examples/jmeter/koutendb-health-load.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="KoutenDB TCP health load" enabled="true">
      <stringProp name="TestPlan.comments">Lightweight TCP load smoke for koutend HEALTH. This validates the server transport path under concurrent clients; it is not a retrieval benchmark.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="HEALTH clients" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(kouten_threads,16)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(kouten_ramp,2)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(kouten_loops,100)}</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <TCPSampler guiclass="TCPSamplerGui" testclass="TCPSampler" testname="HEALTH" enabled="true">
          <stringProp name="TCPSampler.server">${__P(kouten_host,127.0.0.1)}</stringProp>
          <stringProp name="TCPSampler.port">${__P(kouten_port,17301)}</stringProp>
          <stringProp name="TCPSampler.request">HEALTH&#10;</stringProp>
          <boolProp name="TCPSampler.reUseConnection">true</boolProp>
          <boolProp name="TCPSampler.closeConnection">false</boolProp>
          <stringProp name="TCPSampler.timeout">5000</stringProp>
          <stringProp name="TCPSampler.ctimeout">5000</stringProp>
          <stringProp name="TCPSampler.eolByte">10</stringProp>
        </TCPSampler>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${__P(kouten_jtl,koutendb-health-load.jtl)}</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>